32# 'nodemon' কিভাবে আপনার মেশিনে গ্লোবালি ইন্সটল করবেন?
'nodemon' প্যাকেজটি আপনার মেশিনে গ্লোবালি ইন্সটল করবেন কিভাবে? সব গুলো সঠিক উত্তর সিলেক্ট করতে হবে

1.	npm i nodemon
2.	npm i –g nodemon
3.	npm install -g nodemon
4.	npm install nodemon

সঠিক উত্তর: 3 And 2

'nodemon' প্যাকেজটি গ্লোবাল ইন্সটল করতে হলে 'npm install -g nodemon' কমান্ড ইউজ করতে হবে। এটি প্যাকেজটি সিস্টেমের কাছে গ্লোবাল অবস্থায় ইন্সটল করে। প্রথম উত্তর (npm i nodemon) এক্সপ্রেশন দ্বারা প্যাকেজটি লোকেল অবস্থায় ইন্সটল করে।

এক্সপ্রেশন দ্বারা প্যাকেজটি লোকেল অবস্থায় ইন্সটল করে, এবং প্রোজেক্টের কোনো একটি প্যার্ট অথবা মডুল এর জন্য প্রয়োজনীয় ।

তৃতীয় উত্তর ('npm i -g nodemon') টুকি উত্তর, এবং চৌথায় উত্তর ('npm install nodemon')
